In [1]:
from pandas import Series, DataFrame
import pandas as pd
from numpy.random import randn
import numpy as np
import os

### 실습 예제 1번
(5,4)으로 구성되었고 안의 값은 랜덤인 데이터 프레임을 만드시오. 만든 후 4행까지의 1열과 2행까지의 3열을 모두 NaN으로 바꾸어 출력하시오

 (데이터프레임의 이름은 prat이며 이후 예제에도 prat를 사용)

In [4]:
prat=DataFrame(np.random.randn(5,4)) 
prat.ix[:3,1] = None  
prat.ix[:1,3] = None
prat

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  from ipykernel import kernelapp as app

          0         1         2         3
0 -0.528037       NaN  0.497683       NaN
1 -0.838849       NaN -1.944537       NaN
2 -1.123090       NaN  0.640273  1.392277
3 -1.916576       NaN -0.466944  0.802891
4  1.137488  0.189948 -0.049890  1.078909

### 실습 예제 2번
NaN값을 제외해서 출력하시오

In [5]:
prat.dropna()

          0         1        2         3
4  1.137488  0.189948 -0.04989  1.078909

### 실습 예제 3번
NaN값을 3으로 대체하시오

In [6]:
prat.fillna(3)

          0         1         2         3
0 -0.528037  3.000000  0.497683  3.000000
1 -0.838849  3.000000 -1.944537  3.000000
2 -1.123090  3.000000  0.640273  1.392277
3 -1.916576  3.000000 -0.466944  0.802891
4  1.137488  0.189948 -0.049890  1.078909

### 실습 예제 4번
행에서 NaN값을 제외한 수가 1개 이상이 나오도록 출력하시오

In [7]:
prat.dropna(thresh=1)

          0         1         2         3
0 -0.528037       NaN  0.497683       NaN
1 -0.838849       NaN -1.944537       NaN
2 -1.123090       NaN  0.640273  1.392277
3 -1.916576       NaN -0.466944  0.802891
4  1.137488  0.189948 -0.049890  1.078909

### 실습 예제 5번 
2열은 2로 4열은 5로 값을 대체해보시오

In [8]:
prat.fillna({1:2,3:5})

          0         1         2         3
0 -0.528037  2.000000  0.497683  5.000000
1 -0.838849  2.000000 -1.944537  5.000000
2 -1.123090  2.000000  0.640273  1.392277
3 -1.916576  2.000000 -0.466944  0.802891
4  1.137488  0.189948 -0.049890  1.078909

### 실습 예제 6번
NaN값을 모두 10으로 변경하시오

In [9]:
prat.fillna(10, inplace=True)
prat

          0          1         2          3
0 -0.528037  10.000000  0.497683  10.000000
1 -0.838849  10.000000 -1.944537  10.000000
2 -1.123090  10.000000  0.640273   1.392277
3 -1.916576  10.000000 -0.466944   0.802891
4  1.137488   0.189948 -0.049890   1.078909

### 실습 예제 7번
prat2 라는 이름을 가지고 1, NaN, 10, 4, Nan값을 가진 시리지를 만든 후 Nan값을 평균값으로 채워보시오

(이후 예제는 prat2를 활용한다)

In [11]:
prat2 = Series([1., None, 10, 4, None]) # 시리즈를 만든 것이며 괄호안의 수로 순서대로 값을 채웠다
prat2.fillna(prat2.mean())   # 결측치를 평균값으로 채운다

0     1.0
1     5.0
2    10.0
3     4.0
4     5.0
dtype: float64

### 실습 예제 8번
랜덤으로 10개의 값을 채운 시리즈에 상위 색인은 a(2),c(3),d(2) b(3)로 구성하며 하위 색인은 1~10까지의 수로 한다

In [14]:
## 10개의 값을 가진 시리즈를 만든 후 

prat2 = Series(np.random.randn(10),
              index=[['a', 'a', 'c', 'c', 'c', 'd', 'd', 'b', 'b','b'],
                     [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]])
prat2

a  1     0.670313
   2    -1.278383
c  3    -2.265996
   4    -0.235318
   5    -0.572052
d  6     0.328897
   7     0.069278
b  8    -2.188778
   9    -0.052373
   10   -0.572524
dtype: float64

### 실습 예제 9번
색인이 a와 d인 값들만 출력하시오

In [16]:
prat2.ix[['a', 'd']]

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  if __name__ == '__main__':

a  1    0.670313
   2   -1.278383
d  6    0.328897
   7    0.069278
dtype: float64

### 실습 예제 10번
prat2라는 시리즈를 데이터프레임 형태로 만들어보시오

In [17]:
prat2.unstack()

,1,2,3,4,5,6,7,8,9,10
a,0.670313,-1.278383,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
b,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-2.188778,-0.052373,-0.572524
c,NaN,NaN,-2.265996,-0.235318,-0.572052,NaN,NaN,NaN,NaN,NaN
d,NaN,NaN,NaN,NaN,NaN,0.328897,0.069278,NaN,NaN,NaN

### 실습 예제 11번
prat3이름을 가지고 (5,4)로 구성된 데이터 프레임을 생성하시오 상위 색인은 a(2), b(2), c(1)로 구성되며 하위 색인은 1,2, 1, 2, 1로 구성한다.

columns은 'busan', 'naju', 'naju', 'seoul'와 'korea', 'korea', 'usa', 'usa'로 구성된다. (이후 예제는 prat3를 사용)

In [19]:
prat3 = DataFrame(np.arange(20).reshape((5, 4)),  
                  index=[['a', 'a', 'b', 'b', 'c'], [1, 2, 1, 2, 1],], 
                  columns=[['usa', 'korea',  'korea', 'usa'],  
                           ['la', 'naju', 'naju', 'newyork'], ])
prat3

    usa korea          usa
     la  naju naju newyork
a 1   0     1    2       3
  2   4     5    6       7
b 1   8     9   10      11
  2  12    13   14      15
c 1  16    17   18      19

### 실습 예제 12번
columns에 이름을 붙이되 나라에는 country, 지역에는 region의 이름을 붙여 보시오.

In [21]:
prat3.columns.names = ['country', 'region']
prat3

country usa korea          usa
region   la  naju naju newyork
a 1       0     1    2       3
  2       4     5    6       7
b 1       8     9   10      11
  2      12    13   14      15
c 1      16    17   18      19

### 실습 예제 13번
columns이 region인 행들의 값을 출력하시오

In [22]:
prat3.sum(level = 'region', axis=1)

region  la  naju  newyork
a 1      0     3        3
  2      4    11        7
b 1      8    19       11
  2     12    27       15
c 1     16    35       19

### 실습 예제 14번
prat4 라는 데이터프레임을 만들되 columns이 a인 것은 0부터 7까지 나오게하고, b는 5부터 -2까지 나오게 한다. c는 naver(3), goolge(5)로 하며
d는 0~2, 0~4까지로 만든다. (이후 예제는 prat4를 사용)

In [26]:
prat4 = DataFrame({'a': range(8), 'b': range(5, -3, -1),
                   'c': ['naver', 'naver', 'naver', 'google', 'google', 'google', 'google', 'google'],
                   'd': [0, 1, 2, 0, 1, 2, 3, 4]})
prat4

   a  b       c  d
0  0  5   naver  0
1  1  4   naver  1
2  2  3   naver  2
3  3  2  google  0
4  4  1  google  1
5  5  0  google  2
6  6 -1  google  3
7  7 -2  google  4

### 실습 예제 15번
columns b와 c를 새로운 색인의 중심으로 설정해 보시오. 인덱스에 사용된 값은 그대로 남겨두시오

In [27]:
prat4.set_index(['b', 'c'], drop = False)

           a  b       c  d
b  c
 5 naver   0  5   naver  0
 4 naver   1  4   naver  1
 3 naver   2  3   naver  2
 2 google  3  2  google  0
 1 google  4  1  google  1
 0 google  5  0  google  2
-1 google  6 -1  google  3
-2 google  7 -2  google  4